2023-1/cronograma.tex
% Created 2023-04-25 Tue 01:29
% Intended LaTeX compiler: lualatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\input{header.tex}
\author{Prof. Luigi D. C. Soares}
\date{\today}
\title{Cronograma (\color{red}\bfseries última atualização: \today\color{black})}
\hypersetup{
 pdfauthor={Prof. Luigi D. C. Soares},
 pdftitle={Cronograma (\color{red}\bfseries última atualização: \today\color{black})},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.0.50 (Org mode 9.7-pre)}, 
 pdflang={Portuges}}
\begin{document}

\begin{center}
    \Large\bfseries\thetitle{}
\end{center}

\begin{center}
    \fcolorbox{black}{green!30}{\rule{0pt}{6pt}\rule{6pt}{0pt}}\quad Não haverá aula \qquad
    \fcolorbox{black}{yellow!50}{\rule{0pt}{6pt}\rule{6pt}{0pt}}\quad Prova
\end{center}

\rowcolors{2}{gray!10}{gray!25}
\begin{center}
\begin{tabular}{>{\bfseries}ccl>{\bfseries}c}
\toprule
\textbf{Aula} & \textbf{Data} & \textbf{Tópico} & \textbf{Projeto Final}\\[0pt]
\midrule
01 & 14/03 & Apresentação do Curso e Introdução a C++ & \\[0pt]
02 & 16/03 & Armazenamento de Dados em Memória & \\[0pt]
03 & 21/03 & Tipos Abstratos de Dados (TADs) & Divulgação\\[0pt]
04 & 23/03 & TAD: Listas Encadeadas & \\[0pt]
05 & 28/03 & TAD: Biblioteca Padrão (STL) & \\[0pt]
06 & 30/03 & TAD: Biblioteca Padrão (STL) & \\[0pt]
07 & 04/04 & Boas Práticas & \\[0pt]
08 & 06/04 & Modularização & \\[0pt]
09 & 11/04 & Ferramentas de Depuração & \\[0pt]
10 & 13/04 & Versionamento e Revisão de Código & \\[0pt]
11 & 18/04 & Introdução à Orientação a Objetos (POO) & Definição de Tema\\[0pt]
\rowcolor{green!40} & 20/04 & Aula Cancelada & \\[0pt]
12 & 25/04 & Especificação de Software & \\[0pt]
13 & 27/04 & POO: Classes & \\[0pt]
14 & 02/05 & POO: Encapsulamento & \\[0pt]
\rowcolor{yellow!50} 15 & \textbf{04/05} & \textbf{Prova 01: Revisão} & \\[0pt]
\rowcolor{yellow!50} 16 & \textbf{09/05} & \textbf{Prova 01: Aplicação} & \\[0pt]
17 & 11/05 & Acompanhamento/Dúvidas Projeto & Entrega Parcial\\[0pt]
18 & 16/05 & POO: Herança e Composição & \\[0pt]
19 & 18/05 & POO: Herança e Composição & \\[0pt]
20 & 23/05 & POO: Polimorfismo & \\[0pt]
21 & 25/05 & POO: Polimorfismo & \\[0pt]
22 & 30/05 & POO: Gerenciamento de Memória & \\[0pt]
23 & 01/06 & Programação Defensiva & \\[0pt]
24 & 06/06 & Tratamento de Exceções & \\[0pt]
25 & 08/06 & Introdução a Testes e TDD & \\[0pt]
\rowcolor{green!40} & 13/06 & Recesso: Corpus Christi & \\[0pt]
\rowcolor{yellow!50} 26 & \textbf{15/06} & \textbf{Prova 02: Revisão} & \\[0pt]
\rowcolor{yellow!50} 27 & \textbf{20/06} & \textbf{Prova 02: Aplicação} & \\[0pt]
28 & 22/06 & Acompanhamento/Dúvidas Projeto & \\[0pt]
29 & 27/06 & Acompanhamento/Dúvidas Projeto & \\[0pt]
\rowcolor{yellow!50} 30 & \textbf{29/06} & \textbf{Prova substitutiva} & Entrega Final\\[0pt]
 &  &  & \\[0pt]
\rowcolor{yellow!50} &  & \textbf{Exame especial} & \\[0pt]
\bottomrule
\end{tabular}
\end{center}
\end{document}